<?php
    /**
     * @file   modules/layout/lang/jp.lang.php
     * @author zero <zero@nzeo.com> 翻訳：RisaPapa
     * @brief  レイアウト（layout）モジュールの基本言語パッケージ
     **/

    $lang->cmd_layout_management = 'レイアウト設定';
    $lang->cmd_layout_edit = 'レイアウト編集';

    $lang->layout_name = 'レイアウト名';
    $lang->layout_maker = "レイアウト作者";
    $lang->layout_license = 'ライセンス';
    $lang->layout_history = "変更内容 ";
    $lang->layout_info = "レイアウト情報";
    $lang->layout_list = 'レイアウトリスト';
    $lang->menu_count = 'メニュー数';
    $lang->downloaded_list = 'ダウンロードリスト';
    $lang->layout_preview_content = '内容が出力される部分です。';
    $lang->not_apply_menu = 'レイアウトの一括適用';

    $lang->cmd_move_to_installed_list = "作成されたリスト表示";

    $lang->about_downloaded_layouts = "ダウンロードのレイアウトリスト";
    $lang->about_title = 'モジュールとの連動をわかりやすく区分するためのタイトルを入力して下さい。';
    $lang->about_not_apply_menu = 'チェックを入れると連動するすべてのメニューのモジュールのレイアウトを一括変更します。';

    $lang->about_layout = "レイアウトのモジュールはサイトのレイアウトを分かりやすく作成出来るようにします。レイアウトの設定とメニューのリンクで様々なモジュールで完成されたサイトデザインが出来ます。<br />★削除・修正ができないレイアウトはブログまたは他のモジュールのレイアウトであるため、該当するモジュールで設定を行って下さい。";
    $lang->about_layout_code = 
        "下のレイアウトコードを修正し、保存するとサービスに反映されます。
        必ずプレビューで確認してから保存して下さい。
        XEのテンプレート文法は<a href=\"#\" onclick=\"winopen('http://trac.zeroboard.com/trac/wiki/TemplateHandler');return false;\">XEテンプレート</a>を参考して下さい。";

    $lang->layout_export = 'エクスポート';
    $lang->layout_btn_export = 'マイレイアウトをダウンロードする';
    $lang->about_layout_export = 'カスタマイズした自分のレイアウトをエクスポートします。';
    $lang->layout_import = 'インポート';
    $lang->about_layout_import = 'インポートする場合、既存の修正されたレイアウトを上書きします。インポート前にエクスポートでバックアップすることをお勧めします。';

    $lang->layout_manager = array(
        0  => 'レイアウトマネジャー',
        1  => '保存',
        2  => '取り消し',
        3  => '形態',
        4  => '配列',
        5  => '整列',
        6  => '固定型レイアウト',
        7  => '可変型レイアウト',
        8  => '固定+可変(内容)',
        9  => '1欄',
        10 => '2欄 (内容左側)',
        11 => '2欄 (内容右側)',
        12 => '3欄 (内容左側)',
        13 => '3欄 (内容中央)',
        14 => '3欄 (内容右側)',
        15 => '左',
        16 => '中央',
        17 => '右',
        18 => 'すべて',
        19 => 'レイアウト',
        20 => 'ウィジェット追加',
        21 => '内容 ウィジェット追加',
        22 => '属性',
        23 => 'ウィジェットスタイル',
        24 => '修正',
        25 => '削除',
        26 => '整列',
        27 => '一行占め',
        28 => '左',
        29 => '右',
        30 => '横幅サイズ',
        31 => '高さ',
        32 => '外側余白',
        33 => '内側余白',
        34 => '上',
        35 => '左',
        36 => '右',
        37 => '下',
        38 => 'ボーダー', 
        39 => 'なし',
        40 => '背景',
        41 => '色',
        42 => '画像',
        43 => '選択',
        44 => '背景画像リピート',
        45 => 'リピート',
        46 => 'リピートしない',
        47 => '横方向リピート',
        48 => '縦方向リピート',
        49 => '適用',
        50 => '取り消し',
        51 => '初期化',
        52 => '文字',
        53 => '文字フォント',
        54 => 'テキストの色',
    );

    $lang->layout_image_repository = 'レイアウトファイル保存場所';
    $lang->about_layout_image_repository = '選択したレイアウトに使う画像・Ｆｌａｓｈファイル等のアップロード出来ます。また、エクスポートする際、一緒に含まれます。';
    $lang->msg_layout_image_target = 'gif, png, jpg, swf, flvファイルのみ可能です。';
    $lang->layout_migration = 'レイアウトのエクスポート/インポート';
    $lang->about_layout_migration = '修正したレイアウトをtar形式の圧縮ファイルにエクスポートしたり、tar形式として保存されたファイルをインポートすることが出来ます。'."\n".'(まだ、faceOffレイアウトのみエクスポート/インポートが可能です。)';

    $lang->about_faceoff = array(
        'title' => 'XpressEngine FaceOff レイアウト管理ツール',
        'description' => 'FaceOffレイアウト管理ツールはウェブ上で手軽にレイアウト変更を可能にします。<br />下の図を参照しながら構成要素と機能を理解して、自由にレイアウトをカスタマイズしてみて下さい。',
        'layout' => 'FaceOffは上のようなHTML構造になっています。<br />この構造にてCSSを用い、形態／配列／整列が可能になり、さらにStyleを使った自由なカスタマイズが出来ます。<br />ウィジェットの追加はExtension(e1、e2)と Neck、 Kneeにて可能です。<br />その他にBody、Layout、Header、Body、FooterはStyleをカスタマイズ出来、Contentはモジュールの内容が出力されます。',
        'setting' => '左側上段のメニューの説明<br/><ul><li>保存 : 設定内容を保存します。</li><li>取り消し : 設定内容を保存せずに、差し戻します。</li><li>初期化 : 何の設定もない白紙状態に戻します。</li><li>タイプ : 固定／可変／固定+可変（内容）の形態を指定します。</li><li>配列 : Extension 2つとContentを配列します。</li><li>整列 : レイアウトの位置を整列けます。</li></ul>',
        'hotkey' => 'マウスを使って各スペースを選択しながら、Hot Keyを利用するとより便利にカスタマイズ出来ます。<br/><ul><li>tabキー : ウィジェットが選択されたない場合、Header、Body、 Footer順に選択されます。ウィジェットが選択されている場合は、次のウィジェットに選択が移ります。</li><li>Shift + tabキー : tabキーと逆の役割をします。</li><li>Esc : 何も選択されてない場合、Escを押すとNeck、Extension(e1、e2)、Knee順に選択され、また、ウィジェットが選択されている場合は選択されたウィジェットを囲む領域が選択されます。</li><li>矢印 : ウィジェットが選択されている時、矢印キーを用いて、ウィジェットを他の領域に移せます。</li></ul>',
        'attribute' => 'ウィジェットを除いた各領域はすべて背景の色・イメージの指定が出来、文字のテキスト色(「a」タグを含む)の指定が可能です。',

    );
?>
