<?php
  /**
     * @file   ru.lang.php
     * @author zero <zero@nzeo.com> | translation by Maslennikov Evgeny aka X-[Vr]bL1s5 | e-mail: x-bliss[a]tut.by; ICQ: 225035467;
     * @brief  Russian basic language pack for Zeroboard XE
     **/

    $lang->opage = "Внешняя страница";
    $lang->opage_path = "Расположение внешнего документа";
    $lang->opage_caching_interval = "Установить время кеширования";

    $lang->about_opage = "Этот модуль позволяет использовать внешние HTML или PHP файлы в Zeroboard XE.<br />Требует ввода абсолютного или относительного пути. Если URL начинается с 'http://', внешняя страница с другого сервера будет показана.";
    $lang->about_opage_path= "Пожалуйста, введите размещение внешнего документа.<br />Абсолютный путь как '/path1/path2/sample.php', так и относительный как '../path2/sample.php' могут быть использованы.<br />Если Вы введете путь как 'http://url/sample.php', результат будет сначала получен и затем показан.<br />Это текущий абсолютный путь к Zeroboard XE.<br />";
    $lang->about_opage_caching_interval = "Единица измерения равна одной минуте. Это отображает временно сохраненные данные для присвоенного времени.<br />Рекомендуется устанавливать разумное время кеширования, если множество ресурсов нуждаются в показе данных с других серверов.<br />Значение 0 отключает кеширование.";
?>
