<?php
$lang->board = 'Форум';
$lang->cmd_manage_menu = 'Управление меню';
$lang->search_result = 'Результат поиска';
$lang->cmd_board_list = 'Список форумов';
$lang->cmd_module_config = 'Общие настройки форума';
$lang->cmd_board_info = 'Информация форума';
$lang->about_layout_setup = 'Вы можете вручную изменять лейаут код блога. Вставляйте или управляйте кодом виджетов везде, где хотите';
$lang->about_board_category = 'Вы можете сделать категории блога. Когда категория блога испорчена, попробуйте перепостроить файл кеша вручную.';
$lang->about_board = 'Этот модуль служит для создания и управления форумами.';