<?php
  /**
     * @file   ru.lang.php
     * @author zero <zero@nzeo.com> | translation by Maslennikov Evgeny aka X-[Vr]bL1s5 | e-mail: x-bliss[a]tut.by; ICQ: 225035467;
     * @brief  Russian basic language pack for Zeroboard XE
     **/

    // Слова, использованные в кнопке
    $lang->cmd_blog_list = 'Список Блогов';
    $lang->cmd_module_config = 'Общие настройки блога';
    $lang->cmd_view_info = 'Иформация Блога';
    $lang->cmd_manage_menu = 'Управление меню';
    $lang->cmd_make_child = 'Добавить дочернюю категорию';
    $lang->cmd_enable_move_category = "Изменить позицию категории (Перетащите верхнее меню после выделения)";
    $lang->cmd_remake_cache = 'Перепостроить файл кеша';
    $lang->cmd_layout_setup = 'Конфигурировать лейаут';
    $lang->cmd_layout_edit = 'Редактировать лейаут';

    // Объект
    $lang->parent_category_title = 'Родительская категория';
    $lang->category_title = 'Категория';
    $lang->expand = 'Расширить';
    $lang->category_group_srls = 'Доступные Группы';
    $lang->search_result = 'Результат поиска';
    
    // blah blah.. или чушь всякая... ;)
    $lang->about_category_title = 'Пожалуйста, введите название категории';
    $lang->about_expand = 'Если эта опция выбрана, расширение будут применено всегда';
    $lang->about_category_group_srls = 'Только выбранная группа будет способна видеть ткущие категории. (Вручную откройте xml файл, чтобы сделать видимыми)';
    $lang->about_layout_setup = 'Вы можете вручную изменять лейаут код блога. Вставляйте или управляйте кодом виджетов везде, где хотите';
    $lang->about_blog_category = 'Вы можете сделать категории блога.<br />Когда категория блога испорчена, попробуйте перепостроить файл кеша вручную.';
    $lang->about_blog = "Это модуть блогов, который может создавать и управлять блогом.\nПосле создания блога, пожалуйста, украсьте Ваш блог посредством менеджера категорий и скинов, поскольку этот модуль блогов использует лейаут включенный в скин блога.\nЕсли Вы хотите подключить другие форумы внутри блога, используйте модуль меню для создания меню и, затем, подключите его к менеджеру скинов";
?>
