<?php
$lang->cmd_sync_member = 'Синхронизировать';
$lang->cmd_continue = 'Продолжить';
$lang->preprocessing = 'Идет подготовка для импортирования данных';
$lang->importer = 'Импортировать данные Rhymix';
$lang->source_type = 'Предыдущее назначение';
$lang->type_member = 'Данные пользователей';
$lang->type_message = 'Данные сообщения';
$lang->type_module = 'Данные статьи';
$lang->type_syncmember = 'Синхронизировать данные пользователей';
$lang->target_module = 'Модуль назначения';
$lang->xml_file = 'XML файл';
$lang->import_step_title['1'] = 'Шаг 1. Выберите предыдущее назначение';
$lang->import_step_title['12'] = 'Шаг 1-2. Выберите модуль назначения';
$lang->import_step_title['13'] = 'Шаг 1-3. Выберите категорию назначения';
$lang->import_step_title['2'] = 'Шаг 2. Загрузить XML файл';
$lang->import_step_title['3'] = 'Шаг 2. Синхронизировать данные пользователей и статей';
$lang->import_step_title['99'] = 'Импортировать данные';
$lang->import_step_desc['1'] = 'Пожалуйста, выберите тип XML файла, который Вы хотите импортировать.';
$lang->import_step_desc['12'] = 'Пожалуйста, выберите модуль, в который Вы хотите импортировать данные.';
$lang->import_step_desc['121'] = 'запись:';
$lang->import_step_desc['122'] = 'посетители:';
$lang->import_step_desc['13'] = 'Пожалуйста, выберите категорию назначения, в которую Вы хотите импортировать данные.';
$lang->import_step_desc['2'] = 'Пожайлуста, введите расположение XML файла, который Вы хотите импортировать.
Если он находится в одном аккаунте, то введите абсолютный/относительный путь. Если нет, то введите URL, начинающийся с http://';
$lang->import_step_desc['3'] = 'Данные пользователей и статей могут быть некорректны после импорта. В таком случае, выполните синхронизацию для восстановления, основанного на ID.';
$lang->import_step_desc['99'] = 'Идет процесс импортирования данных';
$lang->msg_sync_member = 'Синхронизация данных пользователей и статей начнется по нажатию книпоки "Синхронизировать".';
$lang->msg_no_xml_file = 'XML файл не найден. Пожалуйста, проверьте путь еще раз';
$lang->msg_invalid_xml_file = 'Неверный тип XML файла.';
$lang->msg_importing = 'Пишем %d данные %d. (Если процесс "завис", нажмите кнопку "Продолжить")';
$lang->msg_import_finished = '%d/%d данные были поностью импортированы. В зависимости от ситуации, некоторые данные могут не быть импортированы.';
$lang->msg_sync_completed = 'Выполнена синхронизация пользователей, статей и комментариев.';
$lang->about_type_member = 'Если Вы импортируете информацию пользователей, выберите эту опцию';
$lang->about_type_message = 'Выберите, если импортируются данные сообщения';
$lang->about_type_ttxml = 'Выберите, если импортируются данные TTXML';
$lang->about_ttxml_user_id = 'Введите ID указанного пользователя, сделавшего запись при импортировании данных TTXML. (Пользователь должен быть зарегистрирован)';
$lang->about_type_module = 'Если Вы импортируете информацию форума или записей, выберите эту опцию';
$lang->about_type_syncmember = 'Если Вы пытаетесь синхронизировать информацию пользователей после импорта информации пользователей и записей, выберите эту опцию';
$lang->about_importer = 'Вы можете импортировать данные Zeroboard4, Zeroboard5 Beta или других программ в Rhymix.
Чтобы импортировать, Вам следует использовать <a href="https://github.com/xpressengine/xe-migration-tool" target="_blank">XML Экспортер (XML Exporter)</a>, чтобы конвертировать нужные данные в XML Файл и затем загрузить его.';
$lang->about_target_path = 'Чтобы получить вложения с Zeroboard4, пожалуйста, введите адрес, где установлена  Zeroboard4.
Если она раположена на том же сервере, введите путь к Zeroboard4 как /home/USERID/public_html/bbs
Если нет, введите адрес, где Zeroboard4 установлена. Например: http://Domain/bbs';
