<?php
$lang->page = 'Страница';
$lang->about_page = 'Это модуль блога, который создает полную страницу. Используя последние и другие виджеты, Вы можете создавать динамические страницы. Посредством компонента редактора, Вы можете также создать различные вариации страницы. URL модуля следует тем же правилам, что и другие модули: mid=имя_модуля. Если он выбран как модуль по умолчанию, то он будет главной страницей сайта.';
$lang->cmd_page_modify = 'Изменить';
$lang->page_caching_interval = 'Установить время кеширования';
$lang->about_page_caching_interval = 'Единица измерения равна одной минуте. Это отображает временно сохраненные данные для присвоенного времени. Рекомендуется устанавливать разумное время кеширования, если множество ресурсов нуждаются в показе данных с других серверов. Значение 0 отключает кеширование.';