<?php
  /**
     * @file   ru.lang.php
     * @author zero <zero@nzeo.com> | translation by Maslennikov Evgeny aka X-[Vr]bL1s5 | e-mail: x-bliss[a]tut.by; ICQ: 225035467;
     * @brief  Russian basic language pack for Zeroboard XE
     **/

    // действия
    $lang->cmd_denied_ip = "Черный Список IP-адресов";
    $lang->cmd_denied_word = "Черный Список Слов";

    // главные слова
    $lang->spamfilter = "Фильтр спама";
    $lang->denied_ip = "IP в черный список";
    $lang->interval = "Интервал фильтрования спама";
    $lang->limit_count = "Лимит публикаций";
    $lang->check_trackback = "Проверять трекбек";
    $lang->word = "Слово";

    // описание
    $lang->about_interval = "Все попытки разместить статьи в установленное время будут заблокированы.";
    $lang->about_limit_count = "Если Вы вышли за лимит публикаций (статей/комментариев),\n Ваша статья будет разпознана как спам, и Ваш IP-адрес будет добавлен в черный список.";
    $lang->about_denied_ip = "Вы можете добавить в черный список диапазон IP-адресов как 127.0.0.*, используя знак звездочки (*).";
    $lang->about_denied_word = "Когда Вы добавляете слово в черный список,\n статьи с этим словом не будут опубликованы";
    $lang->about_check_trackback = "Только трекбек для оного IP на статью может быть разрешен.";

    // для отправки сообщений
    $lang->msg_alert_limited_by_config = 'Размещение статьи с интервалом в %s секунд не разрешено.\n Если Вы будете многократно пытаться это сделать, Ваш IP-адрес может быть добавлен в черный список.';
    $lang->msg_alert_denied_word = 'Слово "%s" запрещено для публикации.';
    $lang->msg_alert_registered_denied_ip = 'Ваш IP-адрес занесен в черный список,\n поэтому Вы можете иметь ограничения на полноценное использование этого сайта.\n Если у Вас есть вопросы насчет этого, пожалуйста, сообщите администратору сайта.'; 
    $lang->msg_alert_trackback_denied = 'Разрешен только один трекбек на статью.';
?>
