<?php
$lang->message = '오류 표시';
$lang->about_skin = '오류 메시지용 스킨을 지정할 수 있습니다.';
$lang->msg_administrator_login = '관리자 로그인';
$lang->error_help['baseobject'] = 'Object → BaseObject 변환이 필요한 서드파티 자료가 있습니다. 위의 에러 메시지에 포함된 파일명과 줄 번호를 참고하여 수정하세요.';
$lang->error_help['undef_constant'] = '문자열을 따옴표로 감싸지 않아서 발생하는 오류입니다. 오래된 자료에서 종종 사용하던 문법이나 최근 PHP에서는 허용되지 않으니, 에러 메시지에 포함된 파일명과 줄 번호를 참고하여 수정하세요.';
$lang->error_help['undef_object'] = '객체를 먼저 선언하지 않고 속성을 추가하려 하고 있습니다. 오래된 자료에서 종종 사용하던 코딩 방식이나 최근 PHP에서는 허용되지 않으니, 에러 메시지에 포함된 파일명과 줄 번호를 참고하여 수정하세요.';
$lang->error_help['not_array'] = '배열이 아닌 변수에 배열 함수를 사용하려 하고 있습니다. 오래된 자료에서 종종 사용하던 코딩 방식이나 최근 PHP에서는 허용되지 않으니, 에러 메시지에 포함된 파일명과 줄 번호를 참고하여 수정하세요.';
$lang->error_help['unexpected_eof'] = '조건문이나 템플릿 문법 등에서 괄호의 짝이 맞지 않아 발생하는 오류입니다. 표시되는 위치는 파일의 맨 마지막 줄이지만, 괄호를 열었던 곳을 찾아 수정해야 합니다.';
