<?php
  /**
     * @file   ru.lang.php
     * @author zero <zero@nzeo.com> | translation by Maslennikov Evgeny aka X-[Vr]bL1s5 | e-mail: x-bliss[a]tut.by; ICQ: 225035467;
     * @brief  Russian basic language pack
     **/

    $lang->cmd_menu_insert = 'Создать меню';
    $lang->cmd_menu_management = 'Менеджмент меню';

    $lang->menu = 'Меню'; 
    $lang->menu_count = 'Меню No.';
    $lang->menu_management = 'Менеджмент меню';
    $lang->depth = 'Шаг';
    $lang->parent_menu_name = 'Имя родительского меню';
    $lang->menu_name = 'Имя меню';
    $lang->menu_srl = 'SRL меню';
    $lang->menu_id = 'ID меню';
    $lang->menu_url = 'URL меню';
    $lang->menu_open_window = 'Открыть новое окно';
    $lang->menu_expand = 'Раскрыть';
    $lang->menu_img_btn = 'Изображение кнопки';
    $lang->menu_normal_btn = 'Обычное';
    $lang->menu_hover_btn = 'Мышь над';
    $lang->menu_active_btn = 'Когда выбрано';
    $lang->menu_group_srls = 'Группы с доступом';
    $lang->layout_maker = "Маркет лейаута";
    $lang->layout_history = "История обновлений";
    $lang->layout_info = "Информация лейаутов";
    $lang->layout_list = 'Список лейаутов';
    $lang->downloaded_list = 'Список закачек';
    $lang->limit_menu_depth = 'Лимит глубины';

    $lang->cmd_make_child = 'Добавть дочернее меню';
    $lang->cmd_move_to_installed_list = "Просмотреть созданные меню";
    $lang->cmd_enable_move_menu = "Переместить меню (Перетащите верхнее меню после выделения)";
    $lang->cmd_search_mid = "Поиск меню id";

    $lang->msg_cannot_delete_for_child = 'Невозможно удалить меню с дочерними меню.';

    $lang->about_title = 'Пожалуйста, введите название меню, которое легко проверить при подключению к модулю.';
    $lang->about_menu_management = "Управление меню позволяет Вам заключить меню в вабранный лейаут.\nВы можете создать меню до установленной грубины и ввести информацию детально посредством целчка по нему.\nМеню будет разкрыто щелчком по изображению папки.\nЕсли меню не отображается нормально, обновите информацию щелчком по кнопке \"Пересоздать файл кеша\".\n* Меню, созданное за пределами лимита глубины может отображаться неверно.";
    $lang->about_menu_name = 'Это имя будет показано, если это не административная книпка или кнопка с изображением.';
    $lang->about_menu_url = "Это URL, связанный с меню.<br />Вы можете ввести только id значение к ссылке на другой модуль.<br />Если содержания нет, ничего не произойдет при щелчке по меню.";
    $lang->about_menu_open_window = 'Вы можете присвоить это для открытия ссылки в новом окне при щелчке по меню.';
    $lang->about_menu_expand = 'Это позволяет меню оставаться раскрытым, когда древовидное меню (tree_menu.js) используется.';
    $lang->about_menu_img_btn = 'Если Вы регистрируете кнопку с изображением, изображение автоматически заменит текстовую кнопку, и будет показано в лейауте.';
    $lang->about_menu_group_srls = 'Если Вы выберите группу, то только ее члены могут видеть это меню. (если XML файл открыт напрямую, оно будет показано.)';

    $lang->about_menu = "Модуль меню поможет Вам создать полноценный сайт посредством удобного менеджмента меню, которое расставляет созданные модули и ссылки в лейауты без всякой ручной работы.\nМеню не является менеджером сайта, но оно содержит информацию, которая может связываться с модулями и лейаутами так, что Вы можете выразить различные виды меню.";

    $lang->alert_image_only = "이미지 파일만 등록가능합니다.";
?>
